fsr-byte/me/A_DualCore/A_DualCore_Z4_1/src/HAL/LWIP/netif/MPC5746R_features.h
/* @brief DMA channel width based on number of TCDs: 2^N, N=4,5,... */
#define FEATURE_DMA_CH_WIDTH (6U)
/* @brief DMA channel to instance */
#define FEATURE_DMA_VCH_TO_INSTANCE(x) 	((x) >> (uint32_t)FEATURE_DMA_CH_WIDTH)
/* @brief DMA virtual channel to channel */
#define FEATURE_DMA_VCH_TO_CH(x)        ((x) & ((uint32_t)FEATURE_DMA_CHANNELS - 1U))
/* @brief DMA supports the following particular transfer size: */
#define FEATURE_DMA_TRANSFER_SIZE_16B
#define FEATURE_DMA_TRANSFER_SIZE_32B


/* DMAMUX module features */

/* @brief DMAMUX peripheral is available in silicon. */
#define FEATURE_DMAMUX_AVAILABLE
/* @brief Number of DMA channels. */
#define FEATURE_DMAMUX_CHANNELS (16U)
/* @brief Has the periodic trigger capability */
#define FEATURE_DMAMUX_HAS_TRIG (1)

/* @brief Conversion from eDMA channel index to DMAMUX channel. */
#define FEATURE_DMAMUX_DMA_CH_TO_CH(x) ((x) & (FEATURE_DMAMUX_CHANNELS - 1U))
/* @brief Conversion from DMAMUX channel DMAMUX register index. */
#define FEATURE_DMAMUX_CHN_REG_INDEX(x) (x)

/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections. The user can configure the
 * hardware request into DMAMUX to trigger the DMA transfer accordingly. The index
 * of the hardware request varies according  to the to SoC.
 */
typedef enum {
    EDMA_REQ_MUX_0_DISABLED = 0U,
    EDMA_REQ_SARADC_0_0 = 1U,
    EDMA_REQ_BCTU_2 = 2U,
    EDMA_REQ_ADCSD_0_0_EOC = 3U,
	EDMA_REQ_DECFIL_0_DRAIN = 4U,
	EDMA_REQ_DECFIL_0_FILL = 5U,
	EDMA_REQ_DSPI_0_0_CMD = 6U,
	EDMA_REQ_DSPI_0_0_RX = 7U,
	EDMA_REQ_DSPI_0_0_TX = 8U,
	EDMA_REQ_LINFLEX_0_0_RX = 9U,
	EDMA_REQ_LINFLEX_0_0_TX = 10U,
	EDMA_REQ_SIUL2_REQ0_0 = 11U,
	EDMA_REQ_SIUL2_REQ1 = 12U,
	EDMA_REQ_SIUL2_REQ6 = 13U,
	EDMA_REQ_EMIOS_0_CH8 = 15U,
	EDMA_REQ_EMIOS_0_CH9 = 16U,
	EDMA_REQ_EMIOS_0_CH10 = 17U,
	EDMA_REQ_EMIOS_0_CH11 = 18U,
	EDMA_REQ_EMIOS_0_CH12 = 19U,
	EDMA_REQ_ETPU2_A_CH0_0 = 20U,
	EDMA_REQ_ETPU2_A_CH1_0 = 21U,
	EDMA_REQ_ETPU2_A_CH2_0 = 22U,
	EDMA_REQ_ETPU2_A_CH3 = 23U,
	EDMA_REQ_ETPU2_A_CH4 = 24U,
	EDMA_REQ_ETPU2_A_CH15 = 25U,
	EDMA_REQ_ETPU2_A_CH16 = 26U,
	EDMA_REQ_ETPU2_A_CH17 = 27U,
	EDMA_REQ_ETPU2_A_CH18 = 28U,
	EDMA_REQ_ETPU2_A_CH19 = 29U,
	EDMA_REQ_ETPU2_A_CH30 = 30U,
	EDMA_REQ_ETPU2_A_CH31 = 31U,
	EDMA_REQ_ETPU2_B_CH0_0 = 32U,
	EDMA_REQ_ETPU2_B_CH1_0 = 33U,
	EDMA_REQ_ETPU2_B_CH2_0 = 34U,
	EDMA_REQ_ETPU2_B_CH13 = 35U,
	EDMA_REQ_ETPU2_B_CH14 = 36U,
	EDMA_REQ_ETPU2_B_CH15 = 37U,
	EDMA_REQ_ETPU2_B_CH16 = 38U,
	EDMA_REQ_ETPU2_B_CH17 = 39U,
	EDMA_REQ_ETPU2_B_CH28 = 40U,
	EDMA_REQ_ETPU2_B_CH29 = 41U,
	EDMA_REQ_ETPU2_B_CH30 = 42U,
	EDMA_REQ_ETPU2_B_CH31 = 43U,
	EDMA_REQ_SARADC_2_0 = 44U,
	EDMA_REQ_DSPI_2_0_CMD = 45U,
	EDMA_REQ_DSPI_2_0_RX = 46U,
	EDMA_REQ_DSPI_2_0_TX = 47U,
	EDMA_REQ_SIUL2_REQ4_0 = 48U,
	EDMA_REQ_FLEXCAN_0_0 = 49U,
	EDMA_REQ_REACM_CH0 = 50U,
	EDMA_REQ_REACM_CH3 = 51U,
	EDMA_REQ_REACM_CH6 = 52U,
	EDMA_REQ_REACM_CH7 = 53U,
	EDMA_REQ_MUX_0_ALWAYS_ENABLED_0 = 62U,
	EDMA_REQ_MUX_0_ALWAYS_ENABLED_1 = 63U,
	EDMA_REQ_MUX_1_DISABLED = 64U,
	EDMA_REQ_SARADC_2_1 = 65U,
	EDMA_REQ_BCTU_1_0 = 66U,
	EDMA_REQ_BCTU_3 = 67U,
	EDMA_REQ_DSPI_2_1_CMD = 68U,
	EDMA_REQ_DSPI_2_1_RX = 69U,
	EDMA_REQ_DSPI_2_1_TX = 70U,
	EDMA_REQ_DSPI_M0_CMD = 71U,
	EDMA_REQ_DSPI_M0_RX = 72U,
	EDMA_REQ_DSPI_M0_TX = 73U,
	EDMA_REQ_LINFLEX_M0_RX = 74U,
	EDMA_REQ_LINFLEX_M0_TX = 75U,
	EDMA_REQ_SIUL2_REQ2 = 76U,
	EDMA_REQ_SIUL2_REQ3 = 77U,
	EDMA_REQ_SIUL2_REQ7 = 78U,
	EDMA_REQ_FLEXCAN_2 = 79U,
	EDMA_REQ_EMIOS_0_CH13 = 80U,
	EDMA_REQ_EMIOS_0_CH14 = 81U,
	EDMA_REQ_EMIOS_0_CH15 = 82U,
	EDMA_REQ_EMIOS_0_CH16 = 83U,
	EDMA_REQ_EMIOS_0_CH17 = 84U,
	EDMA_REQ_ETPU2_A_CH5 = 85U,
	EDMA_REQ_ETPU2_A_CH6 = 86U,
	EDMA_REQ_ETPU2_A_CH7 = 87U,
	EDMA_REQ_ETPU2_A_CH8 = 88U,
	EDMA_REQ_ETPU2_A_CH9 = 89U,
	EDMA_REQ_ETPU2_A_CH20 = 90U,
	EDMA_REQ_ETPU2_A_CH21 = 91U,
	EDMA_REQ_ETPU2_A_CH22 = 92U,
	EDMA_REQ_ETPU2_A_CH23 = 93U,
	EDMA_REQ_ETPU2_A_CH24 = 94U,
	EDMA_REQ_ETPU2_B_CH3 = 95U,
	EDMA_REQ_ETPU2_B_CH4 = 96U,
	EDMA_REQ_ETPU2_B_CH5 = 97U,
	EDMA_REQ_ETPU2_B_CH6 = 98U,
	EDMA_REQ_ETPU2_B_CH7 = 99U,
	EDMA_REQ_ETPU2_B_CH18 = 100U,
	EDMA_REQ_ETPU2_B_CH19 = 101U,
	EDMA_REQ_ETPU2_B_CH20 = 102U,
	EDMA_REQ_ETPU2_B_CH21 = 103U,
	EDMA_REQ_ETPU2_B_CH22 = 104U,
	EDMA_REQ_BCTU_0_0 = 105U,
	EDMA_REQ_ADCSD_0_1_EOC = 106U,
	EDMA_REQ_LINFLEX_0_1_RX = 107U,
	EDMA_REQ_LINFLEX_0_1_TX = 108U,
	EDMA_REQ_LINFLEX_2_0_RX = 109U,
	EDMA_REQ_LINFLEX_2_0_TX = 110U,
	EDMA_REQ_SENT_0_0_RX_FAST = 111U,
	EDMA_REQ_SENT_0_0_RX_SLOW = 112U,
	EDMA_REQ_ETPU2_B_CH0_1 = 113U,
	EDMA_REQ_ETPU2_B_CH1_1 = 114U,
	EDMA_REQ_ETPU2_B_CH2_1 = 115U,
	EDMA_REQ_REACM_CH1 = 116U,
	EDMA_REQ_REACM_CH4 = 117U,
	EDMA_REQ_MUX_1_ALWAYS_ENABLED_0 = 127U,
	EDMA_REQ_MUX_2_DISABLED = 128U,
	EDMA_REQ_BCTU_0_1 = 129U,
	EDMA_REQ_ADCSD_2_EOC = 130U,
	EDMA_REQ_DECFIL_1_DRAIN = 131U,
	EDMA_REQ_DECFIL_1_FILL = 132U,
	EDMA_REQ_DSPI_4_CMD = 133U,
	EDMA_REQ_DSPI_4_RX = 134U,
	EDMA_REQ_DSPI_4_TX = 135U,
	EDMA_REQ_LINFLEX_2_1_RX = 136U,
	EDMA_REQ_LINFLEX_2_1_TX = 137U,
	EDMA_REQ_SENT_0_1_RX_FAST = 138U,
	EDMA_REQ_SENT_0_1_RX_SLOW = 139U,
	EDMA_REQ_SIUL2_REQ4_1 = 140U,
	EDMA_REQ_SIUL2_REQ5 = 141U,
	EDMA_REQ_FLEXCAN_0_1 = 142U,
	EDMA_REQ_EMIOS_0_CH18 = 143U,
	EDMA_REQ_EMIOS_0_CH19 = 144U,
	EDMA_REQ_EMIOS_0_CH20 = 145U,
	EDMA_REQ_EMIOS_0_CH21 = 146U,
	EDMA_REQ_EMIOS_0_CH22 = 147U,
    EDMA_REQ_EMIOS_0_CH23 = 148U,
	EDMA_REQ_ETPU2_A_CH10 = 149U,
	EDMA_REQ_ETPU2_A_CH11 = 150U,
	EDMA_REQ_ETPU2_A_CH12 = 151U,
	EDMA_REQ_ETPU2_A_CH13 = 152U,
	EDMA_REQ_ETPU2_A_CH14 = 153U,
	EDMA_REQ_ETPU2_A_CH25 = 154U,
	EDMA_REQ_ETPU2_A_CH26 = 155U,
	EDMA_REQ_ETPU2_A_CH27 = 156U,
	EDMA_REQ_ETPU2_A_CH28 = 157U,
	EDMA_REQ_ETPU2_A_CH29 = 158U,
	EDMA_REQ_ETPU2_B_CH8 = 159U,
	EDMA_REQ_ETPU2_B_CH9 = 160U,
	EDMA_REQ_ETPU2_B_CH10 = 161U,
	EDMA_REQ_ETPU2_B_CH11 = 162U,
	EDMA_REQ_ETPU2_B_CH12 = 163U,
	EDMA_REQ_ETPU2_B_CH23 = 164U,
	EDMA_REQ_ETPU2_B_CH24 = 165U,
	EDMA_REQ_ETPU2_B_CH25 = 166U,
	EDMA_REQ_ETPU2_B_CH26 = 167U,
	EDMA_REQ_ETPU2_B_CH27 = 168U,
	EDMA_REQ_SARADC_0_1 = 169U,
	EDMA_REQ_BCTU_1_1 = 170U,
	EDMA_REQ_DSPI_0_1_CMD = 171U,
	EDMA_REQ_DSPI_0_1_RX = 172U,
	EDMA_REQ_DSPI_0_1_TX = 173U,
	EDMA_REQ_SIUL2_REQ0_1 = 174U,
	EDMA_REQ_ETPU2_A_CH0_1 = 175U,
	EDMA_REQ_ETPU2_A_CH1_1 = 176U,
	EDMA_REQ_ETPU2_A_CH2_1 = 177U,
	EDMA_REQ_REACM_CH2 = 178U,
	EDMA_REQ_REACM_CH5 = 179U,
	EDMA_REQ_REACM_CH8 = 180U,
	EDMA_REQ_REACM_CH9 = 181U,
	EDMA_REQ_MUX_2_ALWAYS_ENABLED_0 = 191U,
	EDMA_REQ_MUX_3_DISABLED = 192U,
	EDMA_REQ_SARADC_1 = 193U,
	EDMA_REQ_SARADC_3 = 194U,
	EDMA_REQ_ADCSD_1_EOC = 195U,
	EDMA_REQ_DSPI_1_CMD = 196U,
	EDMA_REQ_DSPI_1_RX = 197U,
	EDMA_REQ_DSPI_1_TX = 198U,
	EDMA_REQ_DSPI_3_CMD = 199U,
	EDMA_REQ_DSPI_3_RX = 200U,
	EDMA_REQ_DSPI_3_TX = 201U,
	EDMA_REQ_DSPI_M1_CMD = 202U,
	EDMA_REQ_DSPI_M1_RX = 203U,
	EDMA_REQ_DSPI_M1_TX = 204U,
	EDMA_REQ_LINFLEX_1_RX = 205U,
	EDMA_REQ_LINFLEX_1_TX = 206U,
	EDMA_REQ_LINFLEX_3_RX = 207U,
	EDMA_REQ_LINFLEX_3_TX = 208U,
	EDMA_REQ_LINFLEX_M1_RX = 209U,
	EDMA_REQ_LINFLEX_M1_TX = 210U,
	EDMA_REQ_SENT_1_RX_FAST = 211U,
	EDMA_REQ_SENT_1_RX_SLOW = 212U,
	EDMA_REQ_SIPI_CH0 = 213U,
	EDMA_REQ_SIPI_CH1 = 214U,
	EDMA_REQ_SIPI_CH2 = 215U,
	EDMA_REQ_SIPI_CH3 = 216U,
	EDMA_REQ_FLEXCAN_1 = 217U,
	EDMA_REQ_FLEXCAN_3 = 218U,
	EDMA_REQ_EMIOS_1_CH8 = 219U,
	EDMA_REQ_EMIOS_1_CH9 = 220U,
	EDMA_REQ_EMIOS_1_CH10 = 221U,
	EDMA_REQ_EMIOS_1_CH11 = 222U,
	EDMA_REQ_EMIOS_1_CH12 = 223U,
	EDMA_REQ_EMIOS_1_CH13 = 224U,
	EDMA_REQ_EMIOS_1_CH14 = 225U,
	EDMA_REQ_EMIOS_1_CH15 = 226U,
	EDMA_REQ_EMIOS_1_CH16 = 227U,
	EDMA_REQ_EMIOS_1_CH17 = 228U,
	EDMA_REQ_EMIOS_1_CH18 = 229U,
	EDMA_REQ_EMIOS_1_CH19 = 230U,
	EDMA_REQ_EMIOS_1_CH20 = 231U,
	EDMA_REQ_EMIOS_1_CH21 = 232U,
	EDMA_REQ_EMIOS_1_CH22 = 233U,
	EDMA_REQ_EMIOS_1_CH23 = 234U
} dma_request_source_t;

/* EIM module features */

