fsr-byte/me/A_DualCore/A_DualCore_Z4_1/src/HAL/LWIP/netif/MPC5746R_features.h
/* @brief The EIM check-bit mask has 32 bits */
#define FEATURE_EIM_CHECKBITMASK_32BIT
/* @brief The EIM has data mask 1 */
#define FEATURE_EIM_DATAMASK1
/* @brief The EIM channel types */
#define FEATURE_EIM_CH_TYPE_0 (0U)
/* @brief The EIM channel type structure */
#define FEATURE_EIM_CH_TYPE \
{                                \
FEATURE_EIM_CH_TYPE_0,         /* Channel type corresponding to channel 0  */       \
}
/* @brief The EIM number of data words for each channel type  */
#define FEATURE_EIM_CH_TYPE_0_NUM_OF_DATA_WORDS (2U)
/* @brief The EIM WORD0 bitfields for each channel type  */
#define FEATURE_EIM_CH_TYPE_0_WORD0_MASK      0xFE000000u
#define FEATURE_EIM_CH_TYPE_0_WORD0_SHIFT     25u
#define FEATURE_EIM_CH_TYPE_0_WORD0_WRITE(x)  (((uint32_t)(((uint32_t)(x))<<FEATURE_EIM_CH_TYPE_0_WORD0_SHIFT))&FEATURE_EIM_CH_TYPE_0_WORD0_MASK)
#define FEATURE_EIM_CH_TYPE_0_WORD0_READ(x)   (((uint32_t)(((uint32_t)(x))&FEATURE_EIM_CH_TYPE_0_WORD0_MASK))>>FEATURE_EIM_CH_TYPE_0_WORD0_SHIFT)
/* @brief The EIM WORD1 bitfields for each channel type  */
#define FEATURE_EIM_CH_TYPE_0_WORD1_MASK      0xFFFFFFFFu
#define FEATURE_EIM_CH_TYPE_0_WORD1_SHIFT     0u
#define FEATURE_EIM_CH_TYPE_0_WORD1_WRITE(x)  (((uint32_t)(((uint32_t)(x))<<FEATURE_EIM_CH_TYPE_0_WORD1_SHIFT))&FEATURE_EIM_CH_TYPE_0_WORD1_MASK)
#define FEATURE_EIM_CH_TYPE_0_WORD1_READ(x)   (((uint32_t)(((uint32_t)(x))&FEATURE_EIM_CH_TYPE_0_WORD1_MASK))>>FEATURE_EIM_CH_TYPE_0_WORD1_SHIFT)
/* @brief The EIM WORD2 bitfields for each channel type  */
#define FEATURE_EIM_CH_TYPE_0_WORD2_MASK      0xFFFFFFFFu
#define FEATURE_EIM_CH_TYPE_0_WORD2_SHIFT     0u
#define FEATURE_EIM_CH_TYPE_0_WORD2_WRITE(x)  (((uint32_t)(((uint32_t)(x))<<FEATURE_EIM_CH_TYPE_0_WORD2_SHIFT))&FEATURE_EIM_CH_TYPE_0_WORD2_MASK)
#define FEATURE_EIM_CH_TYPE_0_WORD2_READ(x)   (((uint32_t)(((uint32_t)(x))&FEATURE_EIM_CH_TYPE_0_WORD2_MASK))>>FEATURE_EIM_CH_TYPE_0_WORD2_SHIFT)

/* BCTU (Body Cross Triggering Unit) module features */
/*! @brief Number of ADC instances which can be triggered by BCTU */
#define FEATURE_BCTU_NUM_ADC            (4U)
#define FEATURE_BCTU_HAS_CCP            (1U)

/* ADC module features */
#define FEATURE_ADC_HAS_CTU              (1)
#define FEATURE_ADC_HAS_CTU_TRIGGER_MODE (1)
#define FEATURE_ADC_HAS_EXT_TRIGGER      (1)
#define FEATURE_ADC_HAS_INJ_TRIGGER_SEL  (0)
#define FEATURE_ADC_HAS_THRHLR_ARRAY     (1)
#define FEATURE_ADC_HAS_CALIBRATION_ALT  (0)
#define FEATURE_ADC_HAS_CLKSEL_EXTENDED  (0)

#define FEATURE_ADC_HAS_CWSELR_UNROLLED  (1)
#define FEATURE_ADC_HAS_CWSELR0          (1)
#define FEATURE_ADC_HAS_CWSELR1          (1)
#define FEATURE_ADC_HAS_CWSELR2          (1)
#define FEATURE_ADC_HAS_CWSELR3          (1)
#define FEATURE_ADC_HAS_CWSELR4          (1)
#define FEATURE_ADC_HAS_CWSELR5          (0)
#define FEATURE_ADC_HAS_CWSELR6          (0)
#define FEATURE_ADC_HAS_CWSELR7          (0)
#define FEATURE_ADC_HAS_CWSELR8          (1)
#define FEATURE_ADC_HAS_CWSELR9          (1)
#define FEATURE_ADC_HAS_CWSELR10         (1)
#define FEATURE_ADC_HAS_CWSELR11         (1)

#define FEATURE_ADC_BAD_ACCESS_PROT_CHANNEL  (1)
                                      /* 31-28   3-0  63-60  35-32 95-92  68-65
                                          \_/    \_/   \_/    \_/   \_/    \_/
                                           |......|     |......|     |......| */
#define FEATURE_ADC_CHN_AVAIL_BITMAP   {{0xFFFFFFFFu, 0x0000007Fu, 0x00000000u}, /* ADC0 */ \
                                        {0xFFFFFFFFu, 0x0000003Fu, 0x00000000u}, /* ADC1 */ \
                                        {0xFFFFFFFFu, 0x0000000Fu, 0x00000000u}, /* ADC2 */ \
                                        {0x001FFFFFu, 0x0000003Du, 0xFFFFFFFFu}} /* ADC3 */

#define FEATURE_ADC_BAD_ACCESS_PROT_FEATURE  (1)
#define FEATURE_ADC_FEAT_AVAIL_BITMAP  {0xFFFFFFFCu,  /* ADC0 */ \
                                        0xFFFFFFFEu,  /* ADC1 */ \
                                        0xFFFFFFFEu,  /* ADC2 */ \
                                        0xFFFFFFFFu}  /* ADC3 */

/* @brief Default values for sample time. */
#define ADC_DEF_SAMPLE_TIME_0           (0x14U)
#define ADC_DEF_SAMPLE_TIME_1           (0x14U)
#define ADC_DEF_SAMPLE_TIME_2           (0x14U)

/* SDADC module features */
/*! @brief SDADC module has instance 0 */
#define FEATURE_SDADC_HAS_INSTANCE_0      (1u)

/*! @brief SUIL IMCR register number for SDADC input trigger configuring */
#define TRIGGER_IMCR_REGISTER_NUMBERS     {456u, 457u, 458u}
/*! @brief SUIL IMCR register number for SDADC DMA/Interrupt gating configuring */
#define GATE_IMCR_REGISTER_NUMBERS        {448u, 449u, 450u}
/* @brief Max of SDADC clock frequency */
#define SDADC_CLOCK_FREQ_MAX_RUNTIME     (16000000u)
/* @brief Min of SDADC clock frequency */
#define SDADC_CLOCK_FREQ_MIN_RUNTIME     (4000000u)
/*! @brief SDADC instances number */
#define FEATURE_SDADC_HAS_INSTANCE_NUMBER    (3u)
/*! @brief SDADC initial gain error table */
#define SDADC_GAIN_ERROR   {65536, 65536, 65536}
/*! @brief DMA channel number for SDADC instances */
#define SDADC_DMA_CHANNEL_NUMBER   {0xFFu, 0xFFu, 0xFFu}
/*! @brief Interrupts from all SDADC instances are mapped to a single interrupt vector */
#define FEATURE_SDADC_INSTANCES_HAVE_COMMON_INT_VECTOR  (0)


/* ADC PAL features */

#define ADC_PAL_BCTU_CONV_UPDATE_IRQ_UNROLLED           (1)


/* SIUL2 module feature */
/*! @brief SIUL2 module external interrupt support DMA */
#define FEATURE_SIUL2_EXTERNAL_INT_SUPPORT_DMA          (1)
/*! @brief SIUL2 module support Analog Pad */
#define FEATURE_SIUL2_HAS_ANALOG_PAD                    (1)
/*! @brief SIUL2 module Slew rate combine with Drive strength */
#define FEATURE_SIUL2_HAS_SLEW_RATE_WITH_DRIVE_STRENGTH (1)

/*! @brief SIUL2 module input mux numbers */
#define FEATURE_SIUL2_INPUT_MUX_WIDTH                   (16U)
/*! @brief SIUL2 module has specific pull register */
#define FEATURE_SIUL2_HAS_SPECIFIC_PULL_REGISTER        (1U)
/*! @brief SIUL2 module has input level selection */
#define FEATURE_SIUL2_HAS_INPUT_LEVEL_SELECTION         (1U)
/*! @brief SIUL2 module has output drive control */
#define FEATURE_SIUL2_HAS_OUTPUT_DRIVE_CONTROL          (1U)
/*! @brief SIUL2 module has weak pull enable */
#define FEATURE_SIUL2_HAS_WEAK_PULL_ENABLE              (1U)


