fsr-byte/me/A_DualCore/A_DualCore_Z4_1/src/HAL/LWIP/netif/MPC5746R_features.h
/** Number of instances of the SIUL2 module. */
#define GPIO_INSTANCE_COUNT (10u)

/* SIUL2 - Peripheral instance base addresses */
/** Peripheral SIUL2 base address */
#define GPIO_BASE                                (0xFFFC1700u)
/** Peripheral SIUL2 base pointer */
#define GPIO                                     ((GPIO_Type *)GPIO_BASE)

/* GPIO - Peripheral instance base addresses */
/** Peripheral PTA base address */
#define PTA_BASE                                 (0xFFFC1700u)
/** Peripheral PTA base pointer */
#define PTA                                      ((GPIO_Type *)PTA_BASE)
/** Peripheral PTB base address */
#define PTB_BASE                                 (0xFFFC1702u)
/** Peripheral PTB base pointer */
#define PTB                                      ((GPIO_Type *)PTB_BASE)
/** Peripheral PTC base address */
#define PTC_BASE                                 (0xFFFC1704u)
/** Peripheral PTC base pointer */
#define PTC                                      ((GPIO_Type *)PTC_BASE)
/** Peripheral PTD base address */
#define PTD_BASE                                 (0xFFFC1706u)
/** Peripheral PTD base pointer */
#define PTD                                      ((GPIO_Type *)PTD_BASE)
/** Peripheral PTE base address */
#define PTE_BASE                                 (0xFFFC1708u)
/** Peripheral PTE base pointer */
#define PTE                                      ((GPIO_Type *)PTE_BASE)
/** Peripheral PTF base address */
#define PTF_BASE                                 (0xFFFC170Au)
/** Peripheral PTF base pointer */
#define PTF                                      ((GPIO_Type *)PTF_BASE)
/** Peripheral PTG base address */
#define PTG_BASE                                 (0xFFFC170Cu)
/** Peripheral PTG base pointer */
#define PTG                                      ((GPIO_Type *)PTG_BASE)
/** Peripheral PTH base address */
#define PTH_BASE                                 (0xFFFC170Eu)
/** Peripheral PTH base pointer */
#define PTH                                      ((GPIO_Type *)PTH_BASE)
/** Peripheral PTI base address */
#define PTI_BASE                                 (0xFFFC1710u)
/** Peripheral PTI base pointer */
#define PTI                                      ((GPIO_Type *)PTI_BASE)
/** Peripheral PTJ base address */
#define PTJ_BASE                                 (0xFFFC1712u)
/** Peripheral PTJ base pointer */
#define PTJ                                      ((GPIO_Type *)PTJ_BASE)
/** Peripheral PTK base address */
#define PTK_BASE                                 (0xFFFC1714u)
/** Peripheral PTK base pointer */
#define PTK                                      ((GPIO_Type *)PTK_BASE)
/** Peripheral PTL base address */
#define PTL_BASE                                 (0xFFFC1716u)
/** Peripheral PTL base pointer */
#define PTL                                      ((GPIO_Type *)PTL_BASE)
/** Peripheral PTW base address */
#define PTW_BASE                                 (0xFFFC1718u)
/** Peripheral PTW base pointer */
#define PTW                                      ((GPIO_Type *)PTW_BASE)
/** Peripheral PTX base address */
#define PTX_BASE                                 (0xFFFC171Au)
/** Peripheral PTX base pointer */
#define PTX                                      ((GPIO_Type *)PTX_BASE)
/** Peripheral PTY base address */
#define PTY_BASE                                 (0xFFFC171Cu)
/** Peripheral PTY base pointer */
#define PTY                                      ((GPIO_Type *)PTY_BASE)
/** Peripheral PTZ base address */
#define PTZ_BASE                                 (0xFFFC171Eu)
/** Peripheral PTZ base pointer */
#define PTZ                                      ((GPIO_Type *)PTZ_BASE)

/** Array initializer of GPIO peripheral base addresses */
#define GPIO_BASE_ADDRS                          { PTA_BASE, PTB_BASE, PTC_BASE, PTD_BASE, \
                                                   PTE_BASE, PTF_BASE, PTG_BASE, PTH_BASE, \
                                                   PTI_BASE, PTJ_BASE, PTK_BASE, PTL_BASE, \
                                                   PTW_BASE, PTX_BASE, PTY_BASE, PTZ_BASE }
/** Array initializer of GPIO peripheral base pointers */
#define GPIO_BASE_PTRS                           { PTA, PTB, PTC, PTD, PTE, PTF, PTG, PTH, \
                                                   PTI, PTJ, PTK, PTL, PTW, PTX, PTY, PTZ }

#define SIUL2_MSCR_BASE                          (SIUL2->MSCR)
#define SIUL2_IMCR_BASE                          (SIUL2->IMCR)
#define PORTA                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x00))
#define PORTB                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x10))
#define PORTC                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x20))
#define PORTD                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x30))
#define PORTE                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x40))
#define PORTF                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x50))
#define PORTG                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x60))
#define PORTH                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x70))
#define PORTI                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x80))
#define PORTJ                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0x90))
#define PORTK                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0xA0))
#define PORTL                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0xB0))
#define PORTW                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0xC0))
#define PORTX                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0xD0))
#define PORTY                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0xE0))
#define PORTZ                                    ((PORT_Type *)(SIUL2_MSCR_BASE+0xF0))
#define PORT_BASE_PTRS                           { PORTA, PORTB, PORTC, PORTD, PORTE, PORTF, \
                                                   PORTG, PORTH, PORTI, PORTJ, PORTK, PORTL, \
                                                   PORTW, PORTX, PORTY, PORTZ }

/** Define specific pins, which have general purpose pull */
#define PTY0                                     (0U)
#define PTY1                                     (1U)
#define PTY2                                     (2U)
#define PTY3                                     (3U)
#define PTZ0                                     (4U)
#define PTZ1                                     (5U)
#define PTZ2                                     (6U)
#define PTZ3                                     (7U)
#define PTZ4                                     (8U)
#define PTZ5                                     (9U)
#define PTZ6                                     (10U)
#define PTZ7                                     (11U)
#define PTZ8                                     (12U)
#define PTZ9                                     (13U)
#define PTZ10                                    (14U)
#define PTZ11                                    (15U)
#define PTZ12                                    (16U)
#define PTZ13                                    (17U)
#define PTZ14                                    (18U)
#define PTZ15                                    (19U)

/* DSPI module feature */

/* Define the PCS allocation for each DSPI/SPI module */
#define FEATURE_DSPI_0_PCS_NUMBER  6
#define FEATURE_DSPI_1_PCS_NUMBER  5
#define FEATURE_DSPI_2_PCS_NUMBER  4
#define FEATURE_DSPI_3_PCS_NUMBER  6
#define FEATURE_DSPI_4_PCS_NUMBER  6
#define FEATURE_DSPI_M0_PCS_NUMBER 4
#define FEATURE_DSPI_M1_PCS_NUMBER 4

#define FEATURE_DSPI_PCS_MAPPING {FEATURE_DSPI_0_PCS_NUMBER, FEATURE_DSPI_1_PCS_NUMBER, FEATURE_DSPI_2_PCS_NUMBER, \
                                  FEATURE_DSPI_3_PCS_NUMBER, FEATURE_DSPI_4_PCS_NUMBER, FEATURE_DSPI_M0_PCS_NUMBER, FEATURE_DSPI_M1_PCS_NUMBER}


/* Define the initial values for state structures */
#define FEATURE_DSPI_INITIAL_STATE {NULL, NULL, NULL, NULL, NULL, NULL, NULL}


/* Define margins of instances interval */
#define DSPI_LOWEST_INSTANCE  0U
#define DSPI_HIGHEST_INSTANCE 6U

/* Define FIFO size */
#define DSPI_FIFO_SIZE 4U

/* Each interrupt flag has it's own interrupt index */
#define FEATURES_DSPI_HAS_INDEPENDENT_INTERRUPTS 0U

/* On this platform DSPI in extended mode is supported */
#define FEATURE_DSPI_HAS_EXTENDED_MODE 0U

/* Define number of DSPI instances */
#define SPI_INSTANCE_COUNT         0U



