fsr-byte/me/A_DualCore/A_DualCore_Z4_1/src/HAL/LWIP/netif/MPC5746R_features.h
/* EIR Bit Fields */
#define FEC_EIR_UN_MASK                          0x80000u
#define FEC_EIR_UN_SHIFT                         19u
#define FEC_EIR_UN_WIDTH                         1u
#define FEC_EIR_UN(x)                            (((uint32_t)(((uint32_t)(x))<<FEC_EIR_UN_SHIFT))&FEC_EIR_UN_MASK)
#define FEC_EIR_RL_MASK                          0x100000u
#define FEC_EIR_RL_SHIFT                         20u
#define FEC_EIR_RL_WIDTH                         1u
#define FEC_EIR_RL(x)                            (((uint32_t)(((uint32_t)(x))<<FEC_EIR_RL_SHIFT))&FEC_EIR_RL_MASK)
#define FEC_EIR_LC_MASK                          0x200000u
#define FEC_EIR_LC_SHIFT                         21u
#define FEC_EIR_LC_WIDTH                         1u
#define FEC_EIR_LC(x)                            (((uint32_t)(((uint32_t)(x))<<FEC_EIR_LC_SHIFT))&FEC_EIR_LC_MASK)
#define FEC_EIR_EBERR_MASK                       0x400000u
#define FEC_EIR_EBERR_SHIFT                      22u
#define FEC_EIR_EBERR_WIDTH                      1u
#define FEC_EIR_EBERR(x)                         (((uint32_t)(((uint32_t)(x))<<FEC_EIR_EBERR_SHIFT))&FEC_EIR_EBERR_MASK)
#define FEC_EIR_MII_MASK                         0x800000u
#define FEC_EIR_MII_SHIFT                        23u
#define FEC_EIR_MII_WIDTH                        1u
#define FEC_EIR_MII(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_EIR_MII_SHIFT))&FEC_EIR_MII_MASK)
#define FEC_EIR_RXB_MASK                         0x1000000u
#define FEC_EIR_RXB_SHIFT                        24u
#define FEC_EIR_RXB_WIDTH                        1u
#define FEC_EIR_RXB(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_EIR_RXB_SHIFT))&FEC_EIR_RXB_MASK)
#define FEC_EIR_RXF_MASK                         0x2000000u
#define FEC_EIR_RXF_SHIFT                        25u
#define FEC_EIR_RXF_WIDTH                        1u
#define FEC_EIR_RXF(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_EIR_RXF_SHIFT))&FEC_EIR_RXF_MASK)
#define FEC_EIR_TXB_MASK                         0x4000000u
#define FEC_EIR_TXB_SHIFT                        26u
#define FEC_EIR_TXB_WIDTH                        1u
#define FEC_EIR_TXB(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_EIR_TXB_SHIFT))&FEC_EIR_TXB_MASK)
#define FEC_EIR_TXF_MASK                         0x8000000u
#define FEC_EIR_TXF_SHIFT                        27u
#define FEC_EIR_TXF_WIDTH                        1u
#define FEC_EIR_TXF(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_EIR_TXF_SHIFT))&FEC_EIR_TXF_MASK)
#define FEC_EIR_GRA_MASK                         0x10000000u
#define FEC_EIR_GRA_SHIFT                        28u
#define FEC_EIR_GRA_WIDTH                        1u
#define FEC_EIR_GRA(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_EIR_GRA_SHIFT))&FEC_EIR_GRA_MASK)
#define FEC_EIR_BABT_MASK                        0x20000000u
#define FEC_EIR_BABT_SHIFT                       29u
#define FEC_EIR_BABT_WIDTH                       1u
#define FEC_EIR_BABT(x)                          (((uint32_t)(((uint32_t)(x))<<FEC_EIR_BABT_SHIFT))&FEC_EIR_BABT_MASK)
#define FEC_EIR_BABR_MASK                        0x40000000u
#define FEC_EIR_BABR_SHIFT                       30u
#define FEC_EIR_BABR_WIDTH                       1u
#define FEC_EIR_BABR(x)                          (((uint32_t)(((uint32_t)(x))<<FEC_EIR_BABR_SHIFT))&FEC_EIR_BABR_MASK)
#define FEC_EIR_HBERR_MASK                       0x80000000u
#define FEC_EIR_HBERR_SHIFT                      31u
#define FEC_EIR_HBERR_WIDTH                      1u
#define FEC_EIR_HBERR(x)                         (((uint32_t)(((uint32_t)(x))<<FEC_EIR_HBERR_SHIFT))&FEC_EIR_HBERR_MASK)


/* MMFR Bit Fields */
#define FEC_MMFR_DATA_MASK                       0xFFFFu
#define FEC_MMFR_DATA_SHIFT                      0u
#define FEC_MMFR_DATA_WIDTH                      16u
#define FEC_MMFR_DATA(x)                         (((uint32_t)(((uint32_t)(x))<<FEC_MMFR_DATA_SHIFT))&FEC_MMFR_DATA_MASK)
#define FEC_MMFR_TA_MASK                         0x30000u
#define FEC_MMFR_TA_SHIFT                        16u
#define FEC_MMFR_TA_WIDTH                        2u
#define FEC_MMFR_TA(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_MMFR_TA_SHIFT))&FEC_MMFR_TA_MASK)
#define FEC_MMFR_RA_MASK                         0x7C0000u
#define FEC_MMFR_RA_SHIFT                        18u
#define FEC_MMFR_RA_WIDTH                        5u
#define FEC_MMFR_RA(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_MMFR_RA_SHIFT))&FEC_MMFR_RA_MASK)
#define FEC_MMFR_PA_MASK                         0xF800000u
#define FEC_MMFR_PA_SHIFT                        23u
#define FEC_MMFR_PA_WIDTH                        5u
#define FEC_MMFR_PA(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_MMFR_PA_SHIFT))&FEC_MMFR_PA_MASK)
#define FEC_MMFR_OP_MASK                         0x30000000u
#define FEC_MMFR_OP_SHIFT                        28u
#define FEC_MMFR_OP_WIDTH                        2u
#define FEC_MMFR_OP(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_MMFR_OP_SHIFT))&FEC_MMFR_OP_MASK)
#define FEC_MMFR_ST_MASK                         0xC0000000u
#define FEC_MMFR_ST_SHIFT                        30u
#define FEC_MMFR_ST_WIDTH                        2u
#define FEC_MMFR_ST(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_MMFR_ST_SHIFT))&FEC_MMFR_ST_MASK)

/* ECR Bit Fields */
#define FEC_ECR_RESET_MASK                       0x1u
#define FEC_ECR_RESET_SHIFT                      0u
#define FEC_ECR_RESET_WIDTH                      1u
#define FEC_ECR_RESET(x)                         (((uint32_t)(((uint32_t)(x))<<FEC_ECR_RESET_SHIFT))&FEC_ECR_RESET_MASK)
#define FEC_ECR_ETHER_EN_MASK                    0x2u
#define FEC_ECR_ETHER_EN_SHIFT                   1u
#define FEC_ECR_ETHER_EN_WIDTH                   1u
#define FEC_ECR_ETHER_EN(x)                      (((uint32_t)(((uint32_t)(x))<<FEC_ECR_ETHER_EN_SHIFT))&FEC_ECR_ETHER_EN_MASK)

/* PAUR Bit Fields */
#define FEC_PAUR_TYPE_MASK                       0xFFFFu
#define FEC_PAUR_TYPE_SHIFT                      0u
#define FEC_PAUR_TYPE_WIDTH                      16u
#define FEC_PAUR_TYPE(x)                         (((uint32_t)(((uint32_t)(x))<<FEC_PAUR_TYPE_SHIFT))&FEC_PAUR_TYPE_MASK)
#define FEC_PAUR_PADDR2_MASK                     0xFFFF0000u
#define FEC_PAUR_PADDR2_SHIFT                    16u
#define FEC_PAUR_PADDR2_WIDTH                    16u
#define FEC_PAUR_PADDR2(x)                       (((uint32_t)(((uint32_t)(x))<<FEC_PAUR_PADDR2_SHIFT))&FEC_PAUR_PADDR2_MASK)

