fsr-byte/me/A_DualCore/A_DualCore_Z4_1/src/HAL/LWIP/netif/MPC5746R_features.h
/* RDAR Bit Fields */
#define FEC_RDAR_RDAR_MASK                       0x1000000u
#define FEC_RDAR_RDAR_SHIFT                      24u
#define FEC_RDAR_RDAR_WIDTH                      1u
#define FEC_RDAR_RDAR(x)                         (((uint32_t)(((uint32_t)(x))<<FEC_RDAR_RDAR_SHIFT))&FEC_RDAR_RDAR_MASK)
/* TDAR Bit Fields */
#define FEC_TDAR_TDAR_MASK                       0x1000000u
#define FEC_TDAR_TDAR_SHIFT                      24u
#define FEC_TDAR_TDAR_WIDTH                      1u
#define FEC_TDAR_TDAR(x)                         (((uint32_t)(((uint32_t)(x))<<FEC_TDAR_TDAR_SHIFT))&FEC_TDAR_TDAR_MASK)

#define FEC_MIBC_MIB_DIS_MASK                    0x80000000u
#define FEC_MIBC_MIB_DIS_SHIFT                   31u
#define FEC_MIBC_MIB_DIS_WIDTH                   1u
#define FEC_MIBC_MIB_DIS(x)                      (((uint32_t)(((uint32_t)(x))<<FEC_MIBC_MIB_DIS_SHIFT))&FEC_MIBC_MIB_DIS_MASK)


/* FEC - Peripheral instance base addresses */
/** Peripheral FEC base address */
#define FEC_BASE                                 (0xFC0B0000u)
/** Peripheral FEC base pointer */
#define FEC_TWO                                      ((FEC_Type *)FEC_BASE)
/** Array initializer of FEC peripheral base addresses */
#define FEC_BASE_ADDRS                           { FEC_BASE }
/** Array initializer of FEC peripheral base pointers */
#define FEC_BASE_PTRS                            { FEC_TWO }


#define ENET_Type FEC_Type

#define ENET_INSTANCE_COUNT	1
#define ENET_BASE_PTRS		FEC_BASE_PTRS

#define ENET_EIR_BABR_MASK	FEC_EIR_BABR_MASK
#define ENET_EIR_BABT_MASK	FEC_EIR_BABT_MASK
#define ENET_EIR_GRA_MASK	FEC_EIR_GRA_MASK
#define ENET_EIR_TXF_MASK	FEC_EIR_TXF_MASK
#define ENET_EIR_TXB_MASK	FEC_EIR_TXB_MASK
#define ENET_EIR_RXF_MASK	FEC_EIR_RXF_MASK
#define ENET_EIR_RXB_MASK	FEC_EIR_RXB_MASK
#define ENET_EIR_MII_MASK	FEC_EIR_MII_MASK
#define ENET_EIR_EBERR_MASK	FEC_EIR_EBERR_MASK
#define ENET_EIR_LC_MASK	FEC_EIR_LC_MASK
#define ENET_EIR_RL_MASK	FEC_EIR_RL_MASK
#define ENET_EIR_UN_MASK	FEC_EIR_UN_MASK

#define ENET_MMFR_DATA_MASK		FEC_MMFR_DATA_MASK
#define ENET_MMFR_ST			FEC_MMFR_ST
#define ENET_MMFR_OP			FEC_MMFR_OP
#define ENET_MMFR_PA			FEC_MMFR_PA
#define ENET_MMFR_RA			FEC_MMFR_RA
#define ENET_MMFR_TA			FEC_MMFR_TA
#define ENET_MMFR_DATA			FEC_MMFR_DATA
#define ENET_PAUR_PADDR2_MASK	FEC_PAUR_PADDR2_MASK
#define ENET_PAUR_PADDR2_SHIFT	FEC_PAUR_PADDR2_SHIFT
#define ENET_ECR_ETHEREN_MASK	FEC_ECR_ETHER_EN_MASK
#define ENET_TDAR_TDAR_MASK		FEC_TDAR_TDAR_MASK
#define ENET_RDAR_RDAR_MASK		FEC_RDAR_RDAR_MASK
#define ENET_ECR_RESET_MASK		FEC_ECR_RESET_MASK

/* CAN module features */

/* @brief Frames available in Rx FIFO flag shift */
#define FEATURE_CAN_RXFIFO_FRAME_AVAILABLE  (5U)
/* @brief Rx FIFO warning flag shift */
#define FEATURE_CAN_RXFIFO_WARNING          (6U)
/* @brief Rx FIFO overflow flag shift */
#define FEATURE_CAN_RXFIFO_OVERFLOW         (7U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN0 */
#define FEATURE_CAN0_MAX_MB_NUM             (96U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN1 */
#define FEATURE_CAN1_MAX_MB_NUM             (96U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN2 */
#define FEATURE_CAN2_MAX_MB_NUM             (64U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for CAN3 */
#define FEATURE_CAN3_MAX_MB_NUM             (64U)
/* @brief Maximum number of Message Buffers supported for payload size 8 for any of the CAN instances */
#define FEATURE_CAN_MAX_MB_NUM              (96U)
/* @brief Array of maximum number of Message Buffers supported for payload size 8 for all the CAN instances */
#define FEATURE_CAN_MAX_MB_NUM_ARRAY        { FEATURE_CAN0_MAX_MB_NUM, \
                                              FEATURE_CAN1_MAX_MB_NUM, \
                                              FEATURE_CAN2_MAX_MB_NUM, \
                                              FEATURE_CAN3_MAX_MB_NUM  }
/* @brief Has PE clock source select (bit field CAN_CTRL1[CLKSRC]). */
#define FEATURE_CAN_HAS_PE_CLKSRC_SELECT            (0)
/* @brief Has Pretending Networking mode */
#define FEATURE_CAN_HAS_PRETENDED_NETWORKING        (0)
/* @brief Has Stuff Bit Count Enable Bit */
#define FEATURE_CAN_HAS_STFCNTEN_ENABLE             (0)
/* @brief Has ISO CAN FD Enable Bit */
#define FEATURE_CAN_HAS_ISOCANFDEN_ENABLE           (0)
/* @brief Has Message Buffer Data Size Region 1 */
#define FEATURE_CAN_HAS_MBDSR1                      (0)
/* @brief Has Message Buffer Data Size Region 2 */
#define FEATURE_CAN_HAS_MBDSR2                      (0)
/* @brief Has Supervisor Mode MCR[SUPV]*/
#define FEATURE_CAN_HAS_SUPV             	        (1)
/* @brief Has DMA enable (bit field MCR[DMA]). */
#define FEATURE_CAN_HAS_DMA_ENABLE                  (1)
/* @brief Maximum number of Message Buffers IRQs */
#define FEATURE_CAN_MB_IRQS_MAX_COUNT       (4U)
/* @brief Has Wake Up Irq channels (CAN_Wake_Up_IRQS_CH_COUNT > 0u) */
#define FEATURE_CAN_HAS_WAKE_UP_IRQ         (0U)

/*! @brief FlexCAN Embedded RAM address offset */
#define FEATURE_CAN_RAM_OFFSET              (0x00000080u)
/* @brief Has Self Wake Up mode */
#define FEATURE_CAN_HAS_SELF_WAKE_UP        (0)
/* @brief Has Flexible Data Rate */
#define FEATURE_CAN_HAS_FD                  (0)

/* @bried FlexCAN has Detection And Correction of Memory Errors */
#define FEATURE_CAN_HAS_MEM_ERR_DET         (1)
/* @bried FlexCAN has ECC requires clear of RXMASKs reg */
#define FEATURE_CAN_ECC_CLEAR_RXMASKS       (1)

/* TIMING_PAL module features */
/* @brief The issue: PIT and STM modules can not run if the stop in debug mode is enabled */
#define TIMING_PAL_HAS_PIT_STM_NOT_WORK_IN_DEBUG_MODE (1U)


/*! @brief TDR count */
#define TDR_COUNT 6U

/* PASS module features */

/* @brief Has Region 0 */
#define FEATURE_PASS_HAS_RL0                  (0U)
/* @brief Has Region 1 */
#define FEATURE_PASS_HAS_RL1                  (1U)
/* @brief Has Region 2 */
#define FEATURE_PASS_HAS_RL2                  (2U)

/* PASS module features */

