fsr-byte/me/A_DualCore/A_DualCore_Z4_1/src/HAL/LWIP/netif/MPC5746R_features.h
/* @brief Has Region 0 */
#define FEATURE_PASS_HAS_RL0                  (0U)
/* @brief Has Region 1 */
#define FEATURE_PASS_HAS_RL1                  (1U)
/* @brief Has Region 2 */
#define FEATURE_PASS_HAS_RL2                  (2U)

/* ZIPWIRE module features */

/* @brief LFAST data rate change delay */
#define LFAST_DATA_RATE_CHANGE_DELAY 0xFU
/* @brief LFAST wakeup delay control register */
#define LFAST_WAKEUP_DELAY_CONTROL 0x12015402UL
/* @brief LFAST enable slave tx command */
#define LFAST_ENABLE_SLAVE_TX_CMD 0x31U
/* @brief LFAST check slave status command */
#define LFAST_CHECK_SLAVE_STATUS_CMD 0x0U
/* @brief LFAST enable slave pll command */
#define LFAST_ENABLE_SLAVE_PLL_CMD 0x02U
/* @brief LFAST change slave tx speed mode command */
#define LFAST_CHANGE_SLAVE_TX_SPEED_MODE_CMD 0x80U
/* @brief LFAST change slave rx speed mode command */
#define LFAST_CHANGE_SLAVE_RX_SPEED_MODE_CMD 0x10U

/* @brief SIPI channel error flags masks */
#define SIPI_CH0_ERR_MASK 0xFFUL
#define SIPI_CH1_ERR_MASK 0xFF00UL
#define SIPI_CH2_ERR_MASK 0xFF0000UL
#define SIPI_CH3_ERR_MASK 0xFF000000UL
/* @brief SIPI channel count */
#define SIPI_CHANNEL_COUNT 4U
/* @brief SIPI streaming channel number */
#define SIPI_STREAMING_CH 2U
/* @brief SIPI reset timeout */
#define SIPI_RESET_TIMEOUT 10000U
/* @brief SIPI stream channel data register access */
#define SIPI_STREAM_DATA(x) (SIPI->CDR2[(x)])
/* @brief SIPI stream transfer length in bytes */
#define SIPI_STREAM_TRANSFER_LEN 8U
/* @brief SIPI data access macros */
#define SIPI_DATA_SHIFT(x) ((uint32_t)(0x18U & (0x18U << ((uint8_t)(x)))))
#define SIPI_DATA(x,y)     ((x) >> SIPI_DATA_SHIFT(y))
/* @brief SIPI interrupt lines count */
#define SIPI_IRQ_COUNT 7U
/* @brief SIPI separated interrupt lines */
#define SIPI_SEPARATED_INT_LINES


/* DECFILTER module features */
#define FEATURE_DECFILTER_HAS_PSI   (0U)
#define FEATURE_DECFILTER_ENHANCED_DEBUG (0U)

#endif /* MPC5746R_FEATURES_H */

/*******************************************************************************
 * EOF
 ******************************************************************************/
